<?php
    return [
        'today' => 'Бүгін',
        'tomorrow' => 'Ертең',
        'yesterday' => 'Кеше',

        'bot' => [
            'welcome' => 'EasySpeak ботына қош келдіңіз! 👋',
            'connect_title' => '🔗 Қосу',
            'connect_description' => 'Хабарландырулар алу және ботты пайдалану үшін Telegram-ды аккаунтыңызға қосыңыз 👇',
            'connect_congrat' => '👏 :name құттықтаймыз! Сіз өзіңіздің Telegram-аккаунтыңызды біздің ботқа қостыңыз, жалғастыру үшін "Мәзір" батырмасын басыңыз 👇',
            'disconnect' => '🛑 Telegram боттан аккаунтты өшіру',
            'disconnect_confirm' => 'Ботты өшірген жағдайда сіз сабақтар мен маңызды жаңартулар туралы хабарлама алуды тоқтатасыз. Қажет болса, ботты кез келген уақытта қайта қосуға болады. Келісесіз бе?',
            'disconnect_title' => ':name, сіздің Telegram-аккаунт біздің боттан өшірілгенін хабарлаймыз.',
            'my_progress' => '📊 Менің деңгей бойынша жалпы үлгерімім',
            'my_schedule' => '📅 Сабақ кестесі',

            'buttons' => [
                'menu' => '☰ Мәзір',
                'disconnect' => [
                    'confirm' => '✅ Иә, келісемін',
                    'decline' => '❌ Жоқ, қалу',
                ],
                'conference' => [
                    'confirm' => '✅ Растаймын',
                    'decline' => '❌ Қатыса алмаймын',
                ]
            ],

            'settings' => [
                'title' => '⚙️ Баптаулар',
                'select_title' => '👇 Баптауларды таңдаңыз',
                'language' => [
                    'title' => '🌐 Тілді ауыстыру',
                    'select_title' => '👇 Тілді таңдаңыз',
                    'after_select_title' => '✅ Сіз қазақ тілін таңдадыңыз'
                ]
            ],

            'conference' => [
                'link' => '🔗 Сілтемеге өту',
                'reminder' => [
                    'day' => [
                        "learner" => "👋 Сәлеметсізбе :name\n⏰ Ертең сағат :time сабақ\n📘 Сабақтың атауы: :lesson\nСабаққа қатыса алатыныңызды растайсыз ба?",
                        "mentor" => "👋 Сәлеметсізбе :name\n⏰ Ертең сағат :time сабақ\n📘 Сабақтың атауы: :lesson\n",
                    ],
                    'hour' => "👋 Сәлеметсізбе :name\n⏰ Бір сағаттан соң сабақ басталады\n📘 Сабақтың атауы: :lesson\n🔗 Сілтеме сабақтың басталуына 5 минут қалған кезде жіберіледі.",
                    'now' => '📘 :name, сабақтың басталуына :time минут қалды. Сабаққа сілтеме арқылы өте берсеңіз болады.👇'
                ],
                'confirm' => "✅ Оқушы :learner_name сабаққа қатысатынын хабарлайды. \n⏰ Сабақтың басталуы: :time\n📘 Сабақтың атауы: :lesson",
                'decline' => "🛑 Оқушы :learner_name :time болатын сабаққа қатыса алмайтынын хабарлайды.",
                'your_answer_is_accepted' => 'Сіздің жауабыңыз қабылданды. Рахмет! 🙏'
            ],

            'schedule' => [
                'title' => '📅 Міне сізге бір ай алға көрсетілген сабақ кестесі:',
                'no_lessons_title' => '🕵🏻 Қазіргі уақытта алдағы күндерге ешқандай сабақ жоспарланбаған.'
            ]
        ],
    ];
?>