<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */
    'failed'   => 'Неверный E-Mail адрес или пароль.',
    'banned' => 'Ваш аккаунт заблокирован.',
    'not_found' => 'Пользователь с таким E-Mail адресом не найден в данной школе.',
    'school_not_found' => 'Школа с таким доменным адресом не найдена.',
    'already_been_invited' => 'Пользователь с таким эл-адресом уже приглашен на этот курс',
    'wrong_recovery_code' => 'Код для восстановления пароля указана неправильно.',
    'password_was_previously_restored' => 'Пароль по данному коду ранее уже был восстановлен.',
    'user_already_exists' => 'Пользователь с таким E-Mail уже зарегистрирован в этой школе.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds секунд.',
];
