<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */
    'failed'   => 'Неверный E-Mail адрес или пароль.',
    'banned' => 'Ваш аккаунт заблокирован.',
    'not_found' => 'Пользователь с таким E-Mail адресом не найден в данной школе.',
    'school_not_found' => 'Школа с таким доменным адресом не найдена.',
    'already_been_invited' => 'Пользователь с таким эл-адресом уже приглашен на этот курс',
    'wrong_recovery_code' => 'Код для восстановления пароля указана неправильно.',
    'password_was_previously_restored' => 'Пароль по данному коду ранее уже был восстановлен.',
    'user_already_exists' => 'Пользователь с таким E-Mail уже зарегистрирован в этой школе.',
    'section_already_exists' => 'Глава с таким названием уже есть в этом уровне.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds секунд.',
    'remove_at_least_one_letter_in_each_word' => 'Уберите хотя бы одну букву из каждого слова',
    'you_cannot_delete_all_the_letters_in_a_word' => 'Вы не можете удалить все буквы в слове',
    'remove_one_word_in_each_sentence' => 'Вы должны удалить по одному слову из каждого предложения кликнув по ним',
    'you_must_add_two_or_more_options_of_the_missing_words_for_each_sentence' => 'Для каждого предложения необходимо добавить два или более вариантов пропущенных слов'
];
