<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */
    'registration_title' => 'Регистрация',
    'your_sponsor' => 'Ваш спонсор',

    'congratulations' => ':name поздравляем!',
    'registration_successful' => 'Регистрация прошла успешно.',
    'get_bonuses' => 'Получайте бонусные баллы и кэшбэк',
    'download_our_app' => 'Скачивайте наше мобильное приложение из App Store или Google Play',

    'failed'   => 'Некорректная эл.почта или пароль.',
    'banned' => 'Ваш аккаунт заблокирован.',
    'not_found' => 'Такой номер телефона не зарегистрирован.',
    'wrong_sms' => 'Некорректный SMS код',
    'user_already_exists' => 'Пользователь с таким телефоном уже зарегистрирован.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds секунд.',
];
